
class TestData:

    link_of_main_page = "https://qa-scooter.praktikum-services.ru/"
    link_of_order_page = 'https://qa-scooter.praktikum-services.ru/order'
    link_of_yandex_page = 'https://dzen.ru/?yredirect=true'
    data_for_order_1 = {'name': 'Ульяна', 'last_name': 'Ивантеева', 'street': 'Улица 81 марта',
                        'station': 'Сокольники', 'nmbr': '89197795555',
                        'date': "24.05.2023", 'index': 3, 'color': 1, 'mes': "Привет пока пока привет"}
    data_for_order_2 = {'name': 'Анастасия', 'last_name': 'Ильина', 'street': 'Улица 8 марта',
                        'station': 'Сокольники', 'nmbr': '89197795262',
                        'date': "24.05.2023", 'index': 3, 'color': 0, 'mes': "Просьба позвонить"}


    dict_of_question_answer = {'Сколько это стоит? И как оплатить?':
                                   'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
                               'Хочу сразу несколько самокатов! Так можно?':
                                   'Пока что у нас так: один заказ — один самокат. '
                                   'Если хотите покататься с друзьями, можете просто '
                                   'сделать несколько заказов — один за другим.',
                               'Как рассчитывается время аренды?':
                                   'Допустим, вы оформляете заказ на 8 мая. '
                                   'Мы привозим самокат 8 мая в течение дня. '
                                   'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. '
                                   'Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
                                'Можно ли заказать самокат прямо на сегодня?':
                                   'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
                                'Можно ли продлить заказ или вернуть самокат раньше?':
                                   'Пока что нет! Но если что-то срочное — '
                                   'всегда можно позвонить в поддержку по красивому номеру 1010.',
                                'Вы привозите зарядку вместе с самокатом?':
                                   'Самокат приезжает к вам с полной зарядкой. '
                                   'Этого хватает на восемь суток — даже если будете '
                                   'кататься без передышек и во сне. Зарядка не понадобится.',
                                'Можно ли отменить заказ?':
                                   'Да, пока самокат не привезли. Штрафа не будет, объяснительной '
                                   'записки тоже не попросим. Все же свои.',
                                'Я жизу за МКАДом, привезёте?':
                                   'Да, обязательно. Всем самокатов! И Москве, и Московской области.'}

